      * Estrutura padronizada do cliente
           05 NR-CONTA-FILE          PIC 9(09).
           05 PIN-FILE               PIC 9(06).
           05 NOME-FILE              PIC A(30).
           05 SALDO-FILE             PIC 9(07)V99.
